// task 1

/*
пример 1

Вначале к а было прибавлено 1 путем инкремента ++, затем полученное значение присвоено с

пример 2

Вначале текущее значение b (1) было присвоено d, затем значение повысилось до 2 (у b)

пример 3

Значение а было увеличено до 3 путем инкремента, затем к этому значению прибавлено 2, итого 5

пример 4

Вначале к 2 было прибавлено исходное значение b (2), затем b увеличилось до 3 (поэтому alert(b) дает 3), итого 4 для d
Значение а = 3, так как путем инкремента слева два раза увеличивалось.
 */